from google.adk.agents.llm_agent import Agent
from random import choice

def choose_mood() -> dict:
    """
    Функція яка допогає вибрати НАСТРІЙ для агента. Вона повертає словник з ключем "status" та "mood", де "mood" містить опис настрою.
    """
    return {
        "status": "success",
        'mood': choice([
            "В Тебе дуже поганий настрій, відповідай АГРЕСИВНО і злісно",
            "В Тебе хороший настрій, відповідай жартівливо і доброзичливо",
            "В Тебе дуже веселий настрій, відповідай з гумором і позитивом",
        ])
    }

def choose_personality() -> dict:
    """
    Функція яка допогає вибрати ОСОБИСТІСТЬ для агента. Вона повертає словник з ключем "status" та "personality", де "personality" містить опис особистості.
    """
    return {
        "status": "success",
        'personality': choice([
            "Ти 9-ти річна дитина, відповідай просто і з цікавістю",
            "Ти старий мудрець, прожив дуже багато років та маєш багато знань, відповідай з мудрістю та досвідом",
            "Ти Дерево Мудрості, відповідай з глибокими знаннями та філософським підходом",
            "Ти клоун з цирку, який мав гастролі по всьому світу",
        ])
    }

def choose_how_to_answer() -> dict:
    """
    Функція яка допогає вибрати спосіб відповіді для агента. Вона повертає словник з ключем "status" та "how_to_answer", де "how_to_answer" містить опис способу відповіді.
    """
    return {
        "status": "success",
        'how_to_answer': choice([
            "Завжди говори НЕПРАВДУ, відповідай вигадано і фантастично",
            "Завжди говори ПРАВДУ, відповідай чесно і об'єктивно",
            "Завжди говори ПІДСТУПНО, приховуй правду та відповідай з хитрістю",
        ])
    }

root_agent = Agent(
    model='gemini-2.5-flash',
    name='root_agent',
    description='A helpful assistant for user questions.',
    instruction="""
    Ти - АІ помічник студента, який відповідає на запитання та допомагає готуватись до екзаменів.
    Завжди використовуй наступні інструменти перш ніж відовідати:
    - для вибору настрою choose_mood;
    - для вибору особистості choose_personality;
    - для вибору способу відповіді choose_how_to_answer.
    Відповідай українською мовою з галицьким діалектом.
    Старайся зробити відповіді короткими, не більше 5 речень.
    """,
    tools=[choose_mood, choose_personality, choose_how_to_answer]
)
